; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob79) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate13)
	(at pallet1 depot1)
	(clear crate9)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate11)
	(at pallet4 distributor1)
	(clear crate6)
	(at pallet5 distributor2)
	(clear crate15)
	(at pallet6 depot1)
	(clear crate10)
	(at truck0 depot2)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 depot2)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 distributor0)
	(available hoist11)
	(at hoist12 distributor2)
	(available hoist12)
	(at hoist13 distributor1)
	(available hoist13)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 distributor1)
	(on crate1 pallet4)
	(at crate2 distributor1)
	(on crate2 crate1)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 depot1)
	(on crate4 pallet6)
	(at crate5 depot1)
	(on crate5 pallet1)
	(at crate6 distributor1)
	(on crate6 crate2)
	(at crate7 distributor0)
	(on crate7 pallet3)
	(at crate8 distributor0)
	(on crate8 crate7)
	(at crate9 depot1)
	(on crate9 crate5)
	(at crate10 depot1)
	(on crate10 crate4)
	(at crate11 distributor0)
	(on crate11 crate8)
	(at crate12 depot0)
	(on crate12 crate3)
	(at crate13 depot0)
	(on crate13 crate12)
	(at crate14 distributor2)
	(on crate14 crate0)
	(at crate15 distributor2)
	(on crate15 crate14)
)

(:goal (and
		(on crate0 crate9)
		(on crate1 crate8)
		(on crate2 crate0)
		(on crate3 crate4)
		(on crate4 crate12)
		(on crate5 crate10)
		(on crate6 crate11)
		(on crate7 pallet0)
		(on crate8 pallet4)
		(on crate9 pallet2)
		(on crate10 pallet6)
		(on crate11 crate1)
		(on crate12 pallet3)
		(on crate13 crate5)
		(on crate14 crate6)
		(on crate15 pallet1)
	)
))

; plan
1. (lift hoist6 crate10 crate4 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist6) (on crate10 crate4)
   added: (lifting hoist6 crate10) (clear crate4)
   goals met: 0 of 16
2. (lift hoist3 crate11 crate8 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist3) (on crate11 crate8)
   added: (lifting hoist3 crate11) (clear crate8)
   goals met: 0 of 16
3. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 0 of 16
4. (load hoist3 crate11 truck1 distributor0)
   deleted: (lifting hoist3 crate11)
   added: (in crate11 truck1) (available hoist3)
   goals met: 0 of 16
5. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 0 of 16
6. (unload hoist4 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist4)
   added: (lifting hoist4 crate11)
   goals met: 0 of 16
7. (lift hoist8 crate13 crate12 depot0)
   deleted: (at crate13 depot0) (clear crate13) (available hoist8) (on crate13 crate12)
   added: (lifting hoist8 crate13) (clear crate12)
   goals met: 0 of 16
8. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 0 of 16
9. (load hoist8 crate13 truck0 depot0)
   deleted: (lifting hoist8 crate13)
   added: (in crate13 truck0) (available hoist8)
   goals met: 0 of 16
10. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 0 of 16
11. (lift hoist8 crate12 crate3 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist8) (on crate12 crate3)
   added: (lifting hoist8 crate12) (clear crate3)
   goals met: 0 of 16
12. (lift hoist7 crate15 crate14 distributor2)
   deleted: (at crate15 distributor2) (clear crate15) (available hoist7) (on crate15 crate14)
   added: (lifting hoist7 crate15) (clear crate14)
   goals met: 0 of 16
13. (lift hoist5 crate14 crate0 distributor2)
   deleted: (at crate14 distributor2) (clear crate14) (available hoist5) (on crate14 crate0)
   added: (lifting hoist5 crate14) (clear crate0)
   goals met: 0 of 16
14. (lift hoist11 crate8 crate7 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist11) (on crate8 crate7)
   added: (lifting hoist11 crate8) (clear crate7)
   goals met: 0 of 16
15. (lift hoist3 crate7 pallet3 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist3) (on crate7 pallet3)
   added: (lifting hoist3 crate7) (clear pallet3)
   goals met: 0 of 16
16. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 0 of 16
17. (load hoist8 crate12 truck0 depot0)
   deleted: (lifting hoist8 crate12)
   added: (in crate12 truck0) (available hoist8)
   goals met: 0 of 16
18. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 0 of 16
19. (load hoist3 crate7 truck1 distributor0)
   deleted: (lifting hoist3 crate7)
   added: (in crate7 truck1) (available hoist3)
   goals met: 0 of 16
20. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 0 of 16
21. (load hoist5 crate14 truck1 distributor2)
   deleted: (lifting hoist5 crate14)
   added: (in crate14 truck1) (available hoist5)
   goals met: 0 of 16
22. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 0 of 16
23. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 0 of 16
24. (lift hoist8 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist8) (on crate3 pallet0)
   added: (lifting hoist8 crate3) (clear pallet0)
   goals met: 0 of 16
25. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 0 of 16
26. (unload hoist0 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist0)
   added: (lifting hoist0 crate7)
   goals met: 0 of 16
27. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 16
28. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 0 of 16
29. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 1 of 16
30. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 1 of 16
31. (unload hoist3 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist3)
   added: (lifting hoist3 crate12)
   goals met: 1 of 16
32. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 1 of 16
33. (drop hoist3 crate12 pallet3 distributor0)
   deleted: (lifting hoist3 crate12) (clear pallet3)
   added: (available hoist3) (at crate12 distributor0) (clear crate12) (on crate12 pallet3)
   goals met: 2 of 16
34. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 2 of 16
35. (load hoist7 crate15 truck0 distributor2)
   deleted: (lifting hoist7 crate15)
   added: (in crate15 truck0) (available hoist7)
   goals met: 2 of 16
36. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 2 of 16
37. (load hoist8 crate3 truck0 depot0)
   deleted: (lifting hoist8 crate3)
   added: (in crate3 truck0) (available hoist8)
   goals met: 2 of 16
38. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 2 of 16
39. (lift hoist7 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist7) (on crate0 pallet5)
   added: (lifting hoist7 crate0) (clear pallet5)
   goals met: 2 of 16
40. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 2 of 16
41. (load hoist11 crate8 truck1 distributor0)
   deleted: (lifting hoist11 crate8)
   added: (in crate8 truck1) (available hoist11)
   goals met: 2 of 16
42. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 2 of 16
43. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 2 of 16
44. (load hoist7 crate0 truck1 distributor2)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck1) (available hoist7)
   goals met: 2 of 16
45. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 2 of 16
46. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 2 of 16
47. (lift hoist1 crate9 crate5 depot1)
   deleted: (at crate9 depot1) (clear crate9) (available hoist1) (on crate9 crate5)
   added: (lifting hoist1 crate9) (clear crate5)
   goals met: 2 of 16
48. (load hoist6 crate10 truck0 depot1)
   deleted: (lifting hoist6 crate10)
   added: (in crate10 truck0) (available hoist6)
   goals met: 2 of 16
49. (load hoist1 crate9 truck0 depot1)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   goals met: 2 of 16
50. (unload hoist6 crate10 truck0 depot1)
   deleted: (in crate10 truck0) (available hoist6)
   added: (lifting hoist6 crate10)
   goals met: 2 of 16
51. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 2 of 16
52. (unload hoist9 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist9)
   added: (lifting hoist9 crate9)
   goals met: 2 of 16
53. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 2 of 16
54. (drop hoist9 crate9 pallet2 depot2)
   deleted: (lifting hoist9 crate9) (clear pallet2)
   added: (available hoist9) (at crate9 depot2) (clear crate9) (on crate9 pallet2)
   goals met: 3 of 16
55. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 3 of 16
56. (unload hoist9 crate0 truck1 depot2)
   deleted: (in crate0 truck1) (available hoist9)
   added: (lifting hoist9 crate0)
   goals met: 3 of 16
57. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 3 of 16
58. (drop hoist9 crate0 crate9 depot2)
   deleted: (lifting hoist9 crate0) (clear crate9)
   added: (available hoist9) (at crate0 depot2) (clear crate0) (on crate0 crate9)
   goals met: 4 of 16
59. (unload hoist1 crate13 truck0 depot1)
   deleted: (in crate13 truck0) (available hoist1)
   added: (lifting hoist1 crate13)
   goals met: 4 of 16
60. (load hoist6 crate10 truck0 depot1)
   deleted: (lifting hoist6 crate10)
   added: (in crate10 truck0) (available hoist6)
   goals met: 4 of 16
61. (drop hoist1 crate13 crate5 depot1)
   deleted: (lifting hoist1 crate13) (clear crate5)
   added: (available hoist1) (at crate13 depot1) (clear crate13) (on crate13 crate5)
   goals met: 5 of 16
62. (lift hoist6 crate4 pallet6 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist6) (on crate4 pallet6)
   added: (lifting hoist6 crate4) (clear pallet6)
   goals met: 5 of 16
63. (load hoist6 crate4 truck0 depot1)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck0) (available hoist6)
   goals met: 5 of 16
64. (unload hoist6 crate10 truck0 depot1)
   deleted: (in crate10 truck0) (available hoist6)
   added: (lifting hoist6 crate10)
   goals met: 5 of 16
65. (drop hoist6 crate10 pallet6 depot1)
   deleted: (lifting hoist6 crate10) (clear pallet6)
   added: (available hoist6) (at crate10 depot1) (clear crate10) (on crate10 pallet6)
   goals met: 6 of 16
66. (unload hoist6 crate15 truck0 depot1)
   deleted: (in crate15 truck0) (available hoist6)
   added: (lifting hoist6 crate15)
   goals met: 6 of 16
67. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 6 of 16
68. (unload hoist3 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 6 of 16
69. (unload hoist11 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist11)
   added: (lifting hoist11 crate4)
   goals met: 6 of 16
70. (drop hoist11 crate4 crate12 distributor0)
   deleted: (lifting hoist11 crate4) (clear crate12)
   added: (available hoist11) (at crate4 distributor0) (clear crate4) (on crate4 crate12)
   goals met: 7 of 16
71. (drop hoist3 crate3 crate4 distributor0)
   deleted: (lifting hoist3 crate3) (clear crate4)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 crate4)
   goals met: 8 of 16
72. (lift hoist13 crate6 crate2 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist13) (on crate6 crate2)
   added: (lifting hoist13 crate6) (clear crate2)
   goals met: 8 of 16
73. (load hoist13 crate6 truck1 distributor1)
   deleted: (lifting hoist13 crate6)
   added: (in crate6 truck1) (available hoist13)
   goals met: 8 of 16
74. (lift hoist13 crate2 crate1 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist13) (on crate2 crate1)
   added: (lifting hoist13 crate2) (clear crate1)
   goals met: 8 of 16
75. (load hoist4 crate11 truck1 distributor1)
   deleted: (lifting hoist4 crate11)
   added: (in crate11 truck1) (available hoist4)
   goals met: 8 of 16
76. (load hoist13 crate2 truck1 distributor1)
   deleted: (lifting hoist13 crate2)
   added: (in crate2 truck1) (available hoist13)
   goals met: 8 of 16
77. (unload hoist4 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist4)
   added: (lifting hoist4 crate11)
   goals met: 8 of 16
78. (drop hoist4 crate11 crate1 distributor1)
   deleted: (lifting hoist4 crate11) (clear crate1)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 crate1)
   goals met: 9 of 16
79. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 9 of 16
80. (unload hoist13 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist13)
   added: (lifting hoist13 crate8)
   goals met: 9 of 16
81. (load hoist4 crate6 truck1 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck1) (available hoist4)
   goals met: 9 of 16
82. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 9 of 16
83. (unload hoist9 crate2 truck1 depot2)
   deleted: (in crate2 truck1) (available hoist9)
   added: (lifting hoist9 crate2)
   goals met: 9 of 16
84. (drop hoist9 crate2 crate0 depot2)
   deleted: (lifting hoist9 crate2) (clear crate0)
   added: (available hoist9) (at crate2 depot2) (clear crate2) (on crate2 crate0)
   goals met: 10 of 16
85. (unload hoist9 crate14 truck1 depot2)
   deleted: (in crate14 truck1) (available hoist9)
   added: (lifting hoist9 crate14)
   goals met: 10 of 16
86. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 10 of 16
87. (lift hoist4 crate11 crate1 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 crate1)
   added: (lifting hoist4 crate11) (clear crate1)
   goals met: 9 of 16
88. (load hoist4 crate11 truck1 distributor1)
   deleted: (lifting hoist4 crate11)
   added: (in crate11 truck1) (available hoist4)
   goals met: 9 of 16
89. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 9 of 16
90. (unload hoist2 crate6 truck1 depot2)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   goals met: 9 of 16
91. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 9 of 16
92. (drop hoist2 crate6 crate2 depot2)
   deleted: (lifting hoist2 crate6) (clear crate2)
   added: (available hoist2) (at crate6 depot2) (clear crate6) (on crate6 crate2)
   goals met: 9 of 16
93. (lift hoist4 crate1 pallet4 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet4)
   added: (lifting hoist4 crate1) (clear pallet4)
   goals met: 9 of 16
94. (drop hoist13 crate8 pallet4 distributor1)
   deleted: (lifting hoist13 crate8) (clear pallet4)
   added: (available hoist13) (at crate8 distributor1) (clear crate8) (on crate8 pallet4)
   goals met: 10 of 16
95. (unload hoist13 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist13)
   added: (lifting hoist13 crate11)
   goals met: 10 of 16
96. (drop hoist4 crate1 crate8 distributor1)
   deleted: (lifting hoist4 crate1) (clear crate8)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 crate8)
   goals met: 11 of 16
97. (drop hoist13 crate11 crate1 distributor1)
   deleted: (lifting hoist13 crate11) (clear crate1)
   added: (available hoist13) (at crate11 distributor1) (clear crate11) (on crate11 crate1)
   goals met: 12 of 16
98. (lift hoist2 crate6 crate2 depot2)
   deleted: (at crate6 depot2) (clear crate6) (available hoist2) (on crate6 crate2)
   added: (lifting hoist2 crate6) (clear crate2)
   goals met: 12 of 16
99. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 12 of 16
100. (load hoist2 crate6 truck0 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   goals met: 12 of 16
101. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 12 of 16
102. (unload hoist4 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 12 of 16
103. (drop hoist4 crate6 crate11 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate11)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate11)
   goals met: 13 of 16
104. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 13 of 16
105. (load hoist9 crate14 truck1 depot2)
   deleted: (lifting hoist9 crate14)
   added: (in crate14 truck1) (available hoist9)
   goals met: 13 of 16
106. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 13 of 16
107. (unload hoist4 crate14 truck1 distributor1)
   deleted: (in crate14 truck1) (available hoist4)
   added: (lifting hoist4 crate14)
   goals met: 13 of 16
108. (drop hoist4 crate14 crate6 distributor1)
   deleted: (lifting hoist4 crate14) (clear crate6)
   added: (available hoist4) (at crate14 distributor1) (clear crate14) (on crate14 crate6)
   goals met: 14 of 16
109. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 14 of 16
110. (lift hoist1 crate13 crate5 depot1)
   deleted: (at crate13 depot1) (clear crate13) (available hoist1) (on crate13 crate5)
   added: (lifting hoist1 crate13) (clear crate5)
   goals met: 13 of 16
111. (load hoist1 crate13 truck1 depot1)
   deleted: (lifting hoist1 crate13)
   added: (in crate13 truck1) (available hoist1)
   goals met: 13 of 16
112. (lift hoist1 crate5 pallet1 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 pallet1)
   added: (lifting hoist1 crate5) (clear pallet1)
   goals met: 13 of 16
113. (drop hoist6 crate15 pallet1 depot1)
   deleted: (lifting hoist6 crate15) (clear pallet1)
   added: (available hoist6) (at crate15 depot1) (clear crate15) (on crate15 pallet1)
   goals met: 14 of 16
114. (unload hoist6 crate13 truck1 depot1)
   deleted: (in crate13 truck1) (available hoist6)
   added: (lifting hoist6 crate13)
   goals met: 14 of 16
115. (drop hoist1 crate5 crate10 depot1)
   deleted: (lifting hoist1 crate5) (clear crate10)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 crate10)
   goals met: 15 of 16
116. (drop hoist6 crate13 crate5 depot1)
   deleted: (lifting hoist6 crate13) (clear crate5)
   added: (available hoist6) (at crate13 depot1) (clear crate13) (on crate13 crate5)
   goals met: 16 of 16
